package Threadmethod3;

public class ThreadDemo1 {

    public static void main(String[] args) {
        /*
    final void setDaemon(boolean on) 设置为守护线程
    细节：
    当其他的非守护线程执行完毕之后，守护线程会陆续结束
    通俗易懂：
     当女神线程结束了，那么备胎也没有存在的必要了
        */


        Mythread1 t1=new Mythread1();
        Mythread2 t2=new Mythread2();

        t1.setName("女神");
        t2.setName("备胎");

        //把第二个线程设置为守护线程(备胎线程)
        //Deamon 这是守护的含义
        t2.setDaemon(true);

        //当非守护线程(女神)结束完毕
        //守护线程(备胎)其实就没有存在的必要了,然后就不会全部执行完毕
        t1.start();
        t2.start();
        //女神@1
        //备胎@1
        //女神@2
        //备胎@2
        //女神@3
        //女神@4
        //女神@5
        //女神@6
        //女神@7
        //备胎@3
        //女神@8
        //女神@9
        //备胎@4
        //女神@10 //这里女神结束完毕(女神,非守护线程我设置的是1-10)
        //备胎@5
        //备胎@6
        //备胎@7
        //备胎@8
        //备胎@9
        //备胎@10
        //备胎@11//备胎(守护线程我设置的是1-100),也会陆陆续续的结束,不会完全
                 //真的执行到100,因为没有意义,你女神都跑了,你有必要苦苦的整到100吗?





    }
}
